<?php
/**
 *CreatedbyPhpStorm.
 *User:Yanlongli
 *Date:2018/4/40004
 *Time:下午1:11
 *APPLICATION:中文语言包
 */

return array(

    'notFileConfig' => '配置文件不存在！',//Configurationfiledoesnotexist
    'dwtw' => '数据签名校验失败',
    'noResponseCode' => '无应答码',
    'noSignature' => '无签名',
    'checkDataPlease' => '请检查数据是否正确',
    'emptyData' => '空数据',
    'error' => array(
//        'system' => [
//            '010001' => '超时',
//            '010002' => '系统异常',
//            '010003' => '当前服务不可用',
//            '010005' => '系统维护中',
//            '010006' => '系统繁忙',
//            '010007' => '渠道不可用',
//            '010008' => '机构受理异常',
//        ],
//        'transaction' => [
//            '030001' => '	其他错误',
//            '030002' => '	授权码不正确',
//            '030003' => '	订单已重复',
//            '030004' => '	订单已支付',
//            '030005' => '	商户不存在',
//            '030006' => '	订单已撤销',
//            '030007' => '	订单已关闭',
//            '030008' => '	订单不存在',
//            '030009' => '	商户无权限',
//            '030010' => '	用户支付中',
//            '030011' => '	订单已退款',
//            '030012' => '	退款订单不存在',
//            '030013' => '	头寸不足',
//            '030014' => '	退款金额超过原订单总金额',
//            '030015' => '	余额不足',
//            '030016' => '	原订单不存在',
//            '030017' => '	订单不可退款',
//            '030018' => '	商户已入驻',
//            '030020' => '	商户经营类目不存在',
//            '1001' => '非空字段出现空值',
//            '1002' => '验签错误',
//            '1003' => '字段内容错误',
//            '1009' => '商户号不存在 | XX交易未开通',
//            '1010' => '找不到交易',
//            '1011' => '金额超限不允许退款',
//            '1012' => '余额不足不允许退款 | 银联主扫不允许退款',
//            '1013' => '商户订单号重复',
//            '1014' => '报文格式错',
//            '1015' => '请求功能尚不支持',
//            '2001' => '目标方超时',
//            '2002' => '目标方连接失败',
//            '9999' => '系统错误',
//        ]
    ),
);